UPDATE Должности SET Оклад = 50000 WHERE Номер_должности = 1;
UPDATE Должности SET Оклад = 60000 WHERE Номер_должности = 2;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 3;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 4;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 5;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 6;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 7;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 8;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 9;
UPDATE Должности SET Оклад = 70000 WHERE Номер_должности = 10;
UPDATE Должности SET Оклад = 72000 WHERE Номер_должности = 11;
UPDATE Должности SET Оклад = 704000 WHERE Номер_должности = 12;
UPDATE Должности SET Оклад = 704000 WHERE Номер_должности = 12;

SELECT DISTINCT s1.Фамилия_сотр
FROM Сотрудники s1
INNER JOIN История_работы h1 ON s1.Номер_сотр = h1.Номер_сотр
INNER JOIN Штаты st1 ON h1.Номер_отдела = st1.Номер_отдела AND h1.Номер_должности = st1.Номер_должности
INNER JOIN Должности d1 ON st1.Номер_должности = d1.Номер_должности
WHERE EXISTS (
    SELECT 1
    FROM История_работы h2
    INNER JOIN Штаты st2 ON h2.Номер_отдела = st2.Номер_отдела AND h2.Номер_должности = st2.Номер_должности
    INNER JOIN Должности d2 ON st2.Номер_должности = d2.Номер_должности
    WHERE h2.Номер_сотр <> h1.Номер_сотр
    AND h2.Номер_отдела = h1.Номер_отдела
    AND h2.Дата_приема > h1.Дата_приема
    AND d2.Оклад > d1.Оклад
);
